// *** hoisting ***
// فكرتها إنو الجافاسكريبت بتشوف الكود بشكل مختلف عن اللي انت بتكتبو


// console.log("hello woeld");
// console.log("hello woeld");
// console.log("hello woeld");

// var x = 10;
// var y = 20;
// var z = 30;
// انا كتبت الكود بالشكل اللي فوق ولكن الجافاسكريبت حتقرأو كالتالي:
// var x;
// var y;
// var z;
// console.log("hello woeld");
// console.log("hello woeld");
// console.log("hello woeld");
// x = 10;
// y = 20;
// z = 30;
// لكن اذا استخدمت الليت بدل الفار الجافاسكريبت ما حيقرأ بهذا الشكل.

// console.log(x);

// let x = 10;
// الجافا سكريبت حتقرأ الكود زي ما هو, ما رح تعمل ديكلاراشن فوق الكونسول لذلك بحالتنا هاي حيعطيني إيرور مو زي الفار بعطيني أن دي فايند
// console.log(x);

//  var x = 10;
//  هون بقرأ الجافاسكريبت الكود كالتالي:
//  var x;
//  console.log(x);
//  x = 10;
//ادا بدك تستخدم الهويستنج استخدم الفار عادي جدا, لو انت ما بدك تستخدم الهويستنج استخدم الليت, الخيارين متاحين 


// ****
// console.log("hello world");
// function hello()
// {
//     return 1;
// }

// الجافاسكريبت حيقرأ الكود بالترتيب التالي :
// function hello()
// {
//     return 1;
// }
// console.log("hello world");

// console.log(hello());
// function hello()
// {
//     return 1;
// }
// طبعلي 1 لأنو الجافاسكريبت بقرأ الفنكشن بالبداية بعدين بقرأ الكونسول لوق
// افرض انا ما بدي هذا الاشي يصير ؟
// احنا حلينا الموضوع في الفار, كنا نستخدم بدالها الليت وينحل الموضوع لكن هون شو بدنا نعمل ؟


// ****Declaration function & Expression function ****

// function hello()
// {
//     return 1;
// } 
// declaration function اسمها

// let hello = function()
// {
//     return 1;
// } 
// Expression function اسمها 

// الفنكشنين زي بعض لكن طريقة كتابتهم مختلفة لكن الفرق اللي بيناتهم أن 
// الديكلاراشن فنكشن بترتفع فوق الكونسول لوق يعني بنعمل إلها هويستنق
// أما الإكسبريشن فنكشن ما بترتفع فوق الكونسول لوق يعني ما بنعمل إلها هويستنق


// function hello()
// {
//     console.log("hello");
// }
// hello()

// بقدر أكتب كلمة هلو فوق الفنكشن لأن الفنكشن هذا من نوع الديكلاراشن
// ونوع الديكلاراشن فنكشن بعمل هويستنق يعني بمسك الفنكشن وبحطو في البداية وبالتالي
// بقرأو في البداية بعدين بستدعيه
// طبعا أي فنكشن ببدا بكلمة فنكشن بكون من نوع الديكلاراشن

// hello()
// function hello()
// {
//     console.log("hello");
// }



let hello = function()
{
    console.log("hello");
}
hello() // هيك بتشتغل طبيعي بدون أي مشكلة لكن اذا كتبت كلمة هلو 
// او بمعنى آخر اذا استدعيت الفنكشن قبل ما أكتبو حيعطيني إيرور
// لأن هذا النوع من الفنكشن ما بعمل هويستنق يعني ما برفع الفنكشن فوق في
// البداية بالتالي لما تستدعي الفنكشن قبل ما تكتبو ف انت كأنك بتنادي 
// على إشي غير موجود لأنو بقرأ من فوق لتحت هو


// hello: this is a variable
// hello(): this is a function
