// *** scope and self invoked ***

// global

// var x = 10;
// console.log(x); // حيطبعها وتنشاف عادي ..................................................>>>



// // local

// function hello()
// {
// console.log (x); // حتيجي معك وتنشاف عادي كمان
// }
// hello();
// // أي متغير بداخل الفنكشن اسمو لوكال
// // وأي متغير خارج الفنكشن اسمو قلوبال وقلوبال يعني بتقدر 
// // تستخدمها بكل مكان

// console.log (x); // حتيجي معك وتنشاف عادي كمان ...........................................>>>

// function hello()
// {

//     var x = 10;// هذا المتغير ما بتقدر تستخدمو غير بداخل الفنكشن فقط

// }
// hello()
// console.log(x);
//  حيعطيني إيرور لأنو ما حيشوفها بما إنها بداخل الفنكشن
//  لكن لو حطيت الكونسول بداخل الفنكشن حيشوفها 

// function hello()
// if(){}
// for(){}
// while(condition){}
// كل واحد منهم اسمو بلوك أوف كود
// الكلام اللي حكيناه فوق من ناحية اللوكال والقلوبال ما بنطبق إلا على الفنكشن
// الباقي ما بنطبق عليهم هالكلام

// for (var i = 0 ; i < 10 ; i++){  // هذا قلوبال فاريابيل يعني بنشاف بكل مكان وهالحكي بنطبق عالجميع ما عدا الفنكشن , الفنكشن هو الوحيد اللي بحل هاي المشكلة


// }
// console.log(i); // هون بعطيني 10 
// عن طريق استخدام الليت بدل الفار بحل هاي المشكلة عند الجميع
// فقط استبدل الفار بالليت.
// for (let i = 0 ; i < 10 ; i++){ 

// }
// console.log(i); // هون بعطيني نوت ديفايند



// (function()
// {
//     console.log("hello");
// })(); //بهاي الطريقة بخلي الفنكشن تنادي نفسها او تستدعي نفسها


// ***Example
console.log(     x()    );// المناداه بهذا الشكل صحيحة لأنو حيصير عندي هويستنق بسبب أن الفنكشن نوعو ديكلاراشن

function x()
{
    function y(){return 1}
    return y(); // لا تنسى انو قلنا قبل هيك إنو الريتيرن لازم تكون آخر سطر بالكود لأنو اللي بعديها ما بشوفو لكن لا تنسى إنو الفنكشن بنعمل إلو هويستنق بداخل الفنكشن الرئيسية
    function y(){return 0}
}

// الجافاسكريبت حيعمل هويستنق للفنكشن وبالتالي حيقرأها كالتالي: 
// function x()
// {
//     function y(){return 1}
//     function y(){return 0} // هاي الفنكشن اللي رح تشتغل لأنها آخر فنكشن بقرأها
//     return y();  
// }
// console.log(     x()    ); 








